[
    {
        "code": "CSE-4100",
        "title": "Project/Thesis-I",
        "type": "project",
        "credit": "1.5",
        "hours": "1.5 hrs/week",
        "description": "Study, research and solution of a problem in the field of Computer Science and Engineering."
    },
    {
        "code": "CSE-4101",
        "title": "Artificial Intelligence",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "AI Techniques and Applications, Different Search Strategies and Problem Solving, Reasoning, different propositional logic and quantifiers, Inference rule, canonical form and natural language understanding, Framework problems, Complex actions and Planning."
    },
    {
        "code": "CSE-4102",
        "title": "Artificial Intelligence Laboratory",
        "type": "lab",
        "credit": "0.75",
        "hours": "1.5 hrs/week",
        "description": "All the topics covered in this course are based on CSE-4101 (Artificial Intelligence)."
    },
    {
        "code": "CSE-4103",
        "title": "Compiler Design",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "Introduction to Compilers, lexical analyzer, Analyze regular expression, non-deterministic finite automata (NFA) and deterministic finite automata (DFA), Contexts free grammar, ambiguous grammar and basic parsing techniques, Syntax Analyzer: top-down parsing, Bottom-up parsing, operator-precedence parsing, LR parsers, Intermediate code, symbol table, data structure for symbol table, Error detection and recovery, code optimization, code generation."
    },
    {
        "code": "CSE-4104",
        "title": "Compiler Design Laboratory",
        "type": "lab",
        "credit": "0.75",
        "hours": "1.5 hrs/week",
        "description": "All the topics covered in this course are based on CSE-4103 (Compiler Design)."
    },
    {
        "code": "CSE-4105",
        "title": "Information Security and Control",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "Introduction, Cryptography, Digital Signature, Hash Function, Message Authentication Code (MAC), Key Management and Distribution, User Authentication, Network Access Control and Cloud Security, Wireless Network Security, Electronic Mail Security."
    },
    {
        "code": "CSE-4107",
        "title": "Modeling and Simulation",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "Simulation Methods, Model Building, Simulation Examples, Statistical Models in Simulation, Statistical Analysis of Results, Validation and Verification, Simulation and Analytical Methods for Analysis of Computer Systems and Practical Problems in Engineering, Random Numbers and Variates Generation, Modeling Methods, Building Valid, Credible Simulation Models."
    },
    {
        "code": "CSE-4108",
        "title": "Modeling and Simulation Laboratory",
        "type": "lab",
        "credit": "0.75",
        "hours": "1.5 hrs/week",
        "description": "All the topics covered in this course are based on CSE-4107 (Modeling and Simulation)."
    },
    {
        "code": "CSE-4109",
        "title": "VLSI Design",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "VLSI Design Methodology, Introduction to Microelectronics and CMOS technology, Brief overview of Fabrication process, Basic electrical properties of CMOS and BiCMOS circuits, Logic networks, State diagrams, Data flow, Behavioral optimization, Introduction to GaAs technology: Ultra-fast VLSI circuits and systems, Stick diagram and Lambda-based design rules, Subsystem Design processes, Gate Logic, Combinational Design, Clocked Sequential circuits, Bus designs, ALU sub-system, Adder, Multipliers, Memory, Registers and aspects of system timing, Architectural Synthesis: Circuit specification, Architectural optimization, Data-path synthesis, Control unit synthesis, Synthesis and testing of VLSI circuits, Various CAD tools for design, simulation and verification, Introduction to hardware description languages (VHDL and Verilog), Design style: FPGA and CPLDs."
    },
    {
        "code": "CSE-4110",
        "title": "VLSI Design Laboratory",
        "type": "lab",
        "credit": "0.75",
        "hours": "1.5 hrs/week",
        "description": "All the topics covered in this course are based on CSE-4109 (VLSI Design)."
    },
    {
        "code": "CSE-4111",
        "title": "Computer Peripheral and Interfacing",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "Introduction, Memory Interfacing, Data Transfer Techniques and Their Implementation, Common Peripherals and their Interfacing, Programmable Peripheral Interface, Programmable Interval Timer, I/O Devices for Process Control and Instrumentation, Microprocessor in Scientific Instruments and Other Applications."
    },
    {
        "code": "CSE-4112",
        "title": "Computer Peripheral and Interfacing Laboratory",
        "type": "lab",
        "credit": "0.75",
        "hours": "1.5 hrs/week",
        "description": "All the topics covered in this course are based on CSE-4111 (Computer Peripheral and Interfacing)."
    },
    {
        "code": "CSE-4113",
        "title": "Wireless Networks",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "Overview of the wireless communication, Propagation, Capacity, IEEE standard and protocol, Wireless access, Cordless and Wireless System, Generation of wireless, Bluetooth technology, Wireless Protocol."
    },
    {
        "code": "CSE-4114",
        "title": "Wireless Networks Laboratory",
        "type": "lab",
        "credit": "0.75",
        "hours": "1.5 hrs/week",
        "description": "All the topics covered in this course are based on CSE-4113 (Wireless Networks)"
    },
    {
        "code": "CSE-4115",
        "title": "Pattern Recognition",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "Introduction, Statistical and Neural Pattern Recognition, Linear Classifiers, Nonlinear Classifiers, Template Matching, Context Dependent Classification, Syntactic Pattern Recognition, Unsupervised Classification."
    },
    {
        "code": "CSE-4116",
        "title": "Pattern Recognition Laboratory",
        "type": "lab",
        "credit": "0.75",
        "hours": "1.5 hrs/week",
        "description": "All the topics covered in this course are based on CSE-4115 (Pattern Recognition)."
    },
    {
        "code": "CSE-4117",
        "title": "Computer Vision and Image Processing",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "Introduction to Digital Image Processing, Intensity Transformations, Image Enhancement in Spatial Domain, Image enhancement in frequency domain, Image Restoration, Image Compression, Morphological Image Processing, Image Segmentation."
    },
    {
        "code": "CSE-4118",
        "title": "Computer Vision and Image Processing Laboratory",
        "type": "lab",
        "credit": "0.75",
        "hours": "1.5 hrs/week",
        "description": "All the topics covered in this course are based on CSE-4117 (Computer Vision and Image Processing)."
    },
    {
        "code": "CSE-4119",
        "title": "Machine Learning",
        "type": "theory",
        "credit": "3.00",
        "hours": "3 hrs/week",
        "description": "Introduction to machine learning, Artificial Neural Networks, Support Vector Machine, Decision Trees, Genetic Algorithms, Swarm Intelligence, Clustering and Unsupervised Learning, Dimensionality Reduction."
    },
    {
        "code": "CSE-4120",
        "title": "Machine Learning Laboratory",
        "type": "lab",
        "credit": "0.75",
        "hours": "1.5 hrs/week",
        "description": "All the topics covered in this course are based on CSE-4119 (Machine Learning)."
    }
]